module.exports.config = {
    name: "war",
    version: "1.0.0",
    hasPermssion: 0,
    credits: "ADNAN SAMI",
    description: "Start war",
    commandCategory: "system",
    usages: "/war @mention",
    cooldowns: 0
};

global.warTimers = global.warTimers || {};

module.exports.run = async function ({ api, event }) {

    // Only owner
    if (event.senderID !== "100047693744912") {
        return api.sendMessage("❌ Only Adnan can use this command!", event.threadID, event.messageID);
    }

    // Mention check
    const mentionData = event.mentions;
    const mentionIDs = Object.keys(mentionData);

    if (mentionIDs.length === 0) {
        return api.sendMessage("⚠️ Mention someone!", event.threadID, event.messageID);
    }

    const target = mentionIDs[0];
    const targetName = mentionData[target];

    api.sendMessage({
        body: `🔥 WAR STARTED ON ${targetName}`,
        mentions: [{ tag: targetName, id: target }]
    }, event.threadID);

    const msgs = [
        "তর মার ভু*day চায়নার চুং চিং পং বো*ma ব্লাst কইরা আমি তর মার Vhu*দায় পর*মানু সূচনা করবো",
        "তর মাকে আমি র*কেটের সাথে বাইন্ধা ১০০০০০০ হড়স পাওয়ার এ চাদে নিয়া চু*dum",
        "দেখ আকাশ ভরা তারা তোর মারে চু**dmu  তোর dho**ন হবে খাড়া আকাশের অনেক তারার ভিড়ে তোর মারে chu*দলাম আমি নেশার ঘোরে",
        "বিছানার চাদর দিয়ে তর মার দু**ধ টাইট করে বেঁধে ছাদের উপর থেকে ফেলে দিমু!যাতে মানুষ দেখতে পায় le*ংটা অবস্থায়",
        "উড়ন্ত বিমানের পাখায় বাইন্ধা তোর মারে chu*dmu যাতে ম*রার ভয়ে নাড়াচাড়া না করতে পারে",
        "তোর মাকে দু পা কাধে উঠাইয়া chu*দতে chu*দতে বাচ্চা বানাইয়া দিমু🐸",
        "কাঠাল গাছের গোড়া আর আম গাছের ছাল তর মারে chui*ইদ্দা করমু আমি খাল😂",
        "যামু সুন্দরবন নিয়া আসমু হাতির dho*ন আইনা তোর মারে উপ্তা কইরা দিমু এক কঠিন চু*don🐘",
        "ku*ত্তায় chu*দে রাস্তায় বাঘ chu*দে বনে তোর মায়ের কালা vho*দা chu*দমু আমি ঘরের এক কোনে",
        "চু   দে  যাব তোর মারে ধরে সো   নার  ভিতর হারপিক ভরে",
        "তোর মায়ের পাচায় কালা চাপ চো   দা  খেয়ে বলে বাপ রে বাপ",
        "তোর মারে চু   দি  কারন চাড়া করিস না তুই ত্যরাব্যরা",
        "তোর মারে চু   দি  আমি রাস্তার ধারে তোর  বইনরে আমার কুত্তায় পু  টকি মারে",
        "ধো  নে আমার ত্যরামি করে তাই তোর আম্মা কান্না করে",
        "আমার বউ তোর বোন তারে ঢুকামু আফ্রিকান হাতির ধ**ন",
        "তোর বইনরে দেই কঠিন চো  দন৷ তোর মায় চাটে আমার লম্বা ধো  ন",
        "তোর মাকে চু*দে চু*দে করিছে বো*দা লাল তোর মা বলে আমাকে আরো চু*দে দাও একটা এনে আ*বাল",
        "তোর মায়ের সা**উয়ার বারিন্দা আমি রাবিন্দ্রনাতের ধো**ন দিয়া পিটিয়ে পিটিয়ে ভাঙ্গবো",
        "তোমার আম্মুকে আমি চু দ বো আর তুমি তোমার মাকে দু পা পাক করে ধরবা কেমন ছেলে😊🥰",
        "",
    ];

    global.warTimers[target] = setInterval(() => {
        const text = msgs[Math.floor(Math.random() * msgs.length)];

        api.sendMessage({
            body: `${text}\n\n${targetName}`,
            mentions: [{ tag: targetName, id: target }]
        }, event.threadID);

    }, 1500);
};
