module.exports.config = {
    name: "war",
    version: "1.0.0",
    hasPermssion: 0,
    credits: "Shahadat Edit",
    description: "Start war",
    commandCategory: "system",
    usages: "/war @mention",
    cooldowns: 0
};

global.warTimers = global.warTimers || {};

module.exports.run = async function ({ api, event }) {

    // Only owner
    if (event.senderID !== "100047693744912") {
        return api.sendMessage("❌ Only owner can use this command!", event.threadID, event.messageID);
    }

    // Mention check
    const mention = Object.keys(event.mentions);
    if (mention.length === 0) {
        return api.sendMessage("⚠️ Mention someone!", event.threadID, event.messageID);
    }

    const target = mention[0];

    api.sendMessage(`🔥 WAR STARTED ON <@${target}>`, event.threadID);

    const msgs = [
        "তর মার ভু*day চায়নার চুং চিং পং বো*ma ব্লাst কইরা আমি তর মার Vhu*দায় পর*মানু সূচনা করবো",
        "তর মাকে আমি র*কেটের সাথে বাইন্ধা ১০০০০০০ হড়স পাওয়ার এ চাদে নিয়া চু*dum",
        "দেখ আকাশ ভরা তারা তোর মারে চু**dmu  তোর dho**ন হবে খাড়া আকাশের অনেক তারার ভিড়ে তোর মারে chu*দলাম নেশার ঘোরে su*য়োরের বাচ্চা❎❎❎",
        "বিছানার চাদর দিয়ে তর মার দু**ধ ২টি টাইট করে বেঁধে ছাদের উপর থেকে তর মাকে ঠুস করে ফে*লে দিবো যাতে সবাই তর মাকে দেখতে পায় লেং*ta অবস্থায়!",
        "_উড়ন্ত বিমান এর পাখার সামনে নিয়া তোর মারে chu**দবো mo**রার ভয়ে যাতে নড়াচড়া করতে না পারে-!",
        "তোর মাকে দু পা কাধে উঠাইয়া chu*দতে chu*দতে বাচ্চা বানাইয়া দিমু🐸",
        "কাঠাল গাছের গোড়া আর আম গাছের ছাল তর মারে chui*ইদ্দা করমু আমি খাল😂😂",
        "যামু সুন্দরবন নিয়ে আসমু হাতির dho*ন আইনা তোর মারে উপ্তা কইরা দিমু এক কঠিন cho*দন🐘",
        "ku*ত্তায় chu*দে রাস্তায় বাঘ chu*দে বনে তোর মায়ের কালা vho*দা chu*দমু আমি ঘরের এক কনে su*য়ারের বাচ্চা",
        "",
    ];

    // WAR TIMER SAVE GLOBALLY
    global.warTimers[target] = setInterval(() => {
        const text = msgs[Math.floor(Math.random() * msgs.length)];
        api.sendMessage(`${text}\n<@${target}>`, event.threadID);
    }, 1500);
};
